app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    # byebug
    @students = Student.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @student = Student.all.find(params[:id])